Table of Contents
 Class ConcreteCheckResultOverall
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Concrete check result
public class ConcreteCheckResultOverall
Inheritance
object
ConcreteCheckResultOverall
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteCheckResultOverall()
Constructor
public ConcreteCheckResultOverall()
Properties
 Checks
All check by the type
public List<ConcreteCheckResultOverallItem> Checks { get; set; }
Property Value
List<ConcreteCheckResultOverallItem>
 Edit this page